import numpy as np
from scipy.integrate import solve_ivp

#1.定义常微分方程（ODE）函数
def reaction_ode(t,C_A,K):
    """
    t:是时间变量
    C_A:是当前时刻反应物A的浓度（注意：solve_ivp 要求 y 必须是数组或列表，这里作为第一个参数传入）
    K:是反应速率常数
    方程：dC_A/dt = -K * C_A（二级反应）
    我们把C_A作为第一个参数传入
    """
    conc = C_A[0]
    dC_A_dt = -K * conc  #_在Python里面相当于是个分数线
    #返回值必须是个数组或列表，这里返回一个长度为1的数组
    ret = [dC_A_dt]
    return ret
# 2. 设定参数
k = 0.5           # 速率常数
C_A0 = [1.0]      # 初始浓度，必须是列表
t_span = (0, 10)  # 时间范围（从0到10分钟）
t_eval = np.linspace(0, 10, 100) # 生成100个时间点，为了方便绘图
"""请帮我在 0 到 10 之间，等间距地生成 100 个数字，
用来作为我最终要查看结果的时间点。
"""
#这里的t_eval是为了将solve_ivp的乱步子变成等步长的，虽然solve_ivp画出的图是不均匀的
#但是加个等分100个时间点，那么最后的图是均匀的，也可以不加  但是这样图就是不均匀的

# 3. 调用 solve_ivp
sol = solve_ivp(reaction_ode, t_span, C_A0, args=(k,), t_eval=t_eval)
"""求解器，请帮我按照 reaction_ode 里的规律，从 0 分钟模拟到 10 分钟，
初始浓度是 1.0，反应常数是 k，最后把结果按 t_eval 指定的时间点打包给我。

这里的args=（） 括号里面的值是已知且不变的、物理常量，但是其他的参数是要变化的

solve_ivp 的返回值是一个对象，其中包含解的数组，我们可以通过 .y 来访问解的数组。
例如，sol.y[0]也就是指取矩阵的第0行，拿到一个一维数组（包含100个浓度值），sol.y[1] 就是 B 的浓度数组，依此类推。
[-1]代表倒数第一个元素
：.4f 是格式化输出，保留四位小数
sol.y 是指大箱子里面的“浓度矩阵”
"""
# 5. 查看结果
print("====== 二级反应动力学仿真 ======")

# 4. 打印结果
print("====== 二级反应动力学仿真 ======")
print(f"10分钟后，A的浓度变为: {sol.y[0][-1]:.4f} mol/L")
print(f"（提示：一级反应的浓度是0.0067，由于二级反应衰减较慢，这里的数值应该更大）")