import pandas as pd
# 1. 复用之前的模拟数据
data = [
    {"催化剂": "A", "温度": 120, "收率": 65},
    {"催化剂": "A", "温度": 140, "收率": 78},
    {"催化剂": "A", "温度": 160, "收率": 92},
    {"催化剂": "B", "温度": 120, "收率": 80},
    {"催化剂": "B", "温度": 140, "收率": 95},
    {"催化剂": "B", "温度": 160, "收率": 85},
    {"催化剂": "C", "温度": 140, "收率": 70},
    {"催化剂": "C", "温度": 160, "收率": 88},
]
df = pd.DataFrame(data)
# 2.制作透视表:行是温度,列是催化剂,值是收率的均值
pivot = df.pivot_table(
    index="温度", #行索引
    columns="催化剂", #列索引
    values="收率", #值
    aggfunc="mean" #聚合函数    mean:均值函数 是计算value的均值

)

print("======")
print(pivot)